# Import libraries

In [24]:
import numpy as np 
import pandas as pd

# Import datasets

In [25]:
train = pd.read_excel('C:\\Users\\admin\\Downloads\\Data_Train.xlsx')
test = pd.read_excel('C:\\Users\\admin\\Downloads\\Data_Test.xlsx')

In [6]:
train.shape, test.shape

((12690, 9), (4231, 8))

In [26]:
train["source"] = "train"
test["source"] = "test"

In [27]:
df = pd.concat([train,test])

In [28]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 16921 entries, 0 to 4230
Data columns (total 10 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   TITLE          16921 non-null  object
 1   RESTAURANT_ID  16921 non-null  int64
 2   CUISINES       16921 non-null  object
 3   TIME           16921 non-null  object
 4   CITY           16774 non-null  object
 5   LOCALITY       16793 non-null  object
 6   RATING         16917 non-null  object
 7   VOTES          15315 non-null  object
 8   COST           12690 non-null  float64
 9   source         16921 non-null  object
dtypes: float64(1), int64(1), object(8)
memory usage: 1.4+ MB

In [29]:
#Investigating the entire dataset first
df.duplicated().sum()

26

In [30]:
df= df.drop_duplicates()

In [31]:
df.isna().sum()

TITLE               0
RESTAURANT_ID       0
CUISINES            0
TIME                0
CITY              147
LOCALITY          128
RATING              4
VOTES            1602
COST             4230
source              0
dtype: int64

In [32]:
# Data exploration for CITY
# CITY has 147 null values
#combining City and locality
df['Location']=df['CITY']+' '+df['LOCALITY']
df.drop(columns=['CITY','LOCALITY'])

,TITLE,RESTAURANT_ID,CUISINES,TIME,RATING,VOTES,COST,source,Location
0,CASUAL DINING,9438,"Malwani, Goan, North Indian","11am – 4pm, 7:30pm – 11:30pm (Mon-Sun)",3.6,49 votes,1200.0,train,Thane Dombivali East
1,"CASUAL DINING,BAR",13198,"Asian, Modern Indian, Japanese",6pm – 11pm (Mon-Sun),4.2,30 votes,1500.0,train,Chennai Ramapuram
2,CASUAL DINING,10915,"North Indian, Chinese, Biryani, Hyderabadi","11am – 3:30pm, 7pm – 11pm (Mon-Sun)",3.8,221 votes,800.0,train,Chennai Saligramam
3,QUICK BITES,6346,"Tibetan, Chinese",11:30am – 1am (Mon-Sun),4.1,24 votes,800.0,train,Mumbai Bandra West
4,DESSERT PARLOR,15387,Desserts,11am – 1am (Mon-Sun),3.8,165 votes,300.0,train,Mumbai Lower Parel
...,...,...,...,...,...,...,...,...,...
4226,CASUAL DINING,9057,"North Indian, Mughlai, Chinese",11:30am – 11:30pm (Mon-Sun),3.9,287 votes,NaN,test,New Delhi Punjabi Bagh
4227,None,1247,"Biryani, North Indian, Sandwich, Salad, Wraps",11am – 1am (Mon-Sun),4.3,469 votes,NaN,test,Bangalore HSR Layout
4228,QUICK BITES,8617,"Continental, North Indian",9:30am – 10:30pm (Mon-Sun),3.7,53 votes,NaN,test,Faridabad Sector 86
4229,QUICK BITES,6485,"Rolls, Beverages","11am – 11:30pm (Mon, Tue, Wed, Thu, Sat, Sun),...",-,NaN,NaN,test,Kochi Kochi
4230,QUICK BITES,2421,Mughlai,5pm – 1am (Mon-Sun),3.7,63 votes,NaN,test,Bandra West Perry Cross Road

In [33]:
df.dropna(subset=['Location'],inplace=True)

In [36]:
cuisines_list=[]
for row in df['CUISINES']:
    cuisines_list.append(list(row.split(',')))

df['CUISINES']=cuisines_list

In [37]:
df['CUISINES'].isna().sum()

0

In [38]:
df_cuisines=df['CUISINES'].apply(lambda x: pd.Series(1, x))

In [39]:
title_list=[]
for row in df['TITLE']:
    title_list.append(list(row.split(',')))
df['TITLE']=title_list

In [40]:
df_title=df['TITLE'].apply(lambda x: pd.Series(1, x))

In [41]:
df_title.head()

,CASUAL DINING,BAR,QUICK BITES,DESSERT PARLOR,CAFÉ,MICROBREWERY,BEVERAGE SHOP,IRANI CAFE,BAKERY,None,...,FOOD TRUCK,MESS,KIOSK,CLUB,CONFECTIONERY,DHABA,MEAT SHOP,COCKTAIL BAR,PAAN SHOP,BHOJANALYA
0,1.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,1.0,1.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,1.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,NaN,1.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,1.0,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [42]:
df[df['RATING'].isna()]

,TITLE,RESTAURANT_ID,CUISINES,TIME,CITY,LOCALITY,RATING,VOTES,COST,source,Location
204,[BAKERY],15062,[Bakery],Not Available,Kochi,Marine Drive,NaN,NaN,200.0,train,Kochi Marine Drive
421,[CAFÉ],14127,"[Cafe, Fast Food]",Not Available,Hyderabad,Banjara Hills,NaN,NaN,350.0,train,Hyderabad Banjara Hills
2035,[QUICK BITES],2776,"[Kerala, Arabian]",Not Available,Kochi,Kakkanad,NaN,NaN,NaN,test,Kochi Kakkanad
2758,[None],11301,"[Chinese, North Indian, South Indian]",Not Available,Kochi,Tripunithura,NaN,NaN,NaN,test,Kochi Tripunithura

In [43]:
df["RATING"] = df.groupby("CITY").RATING.transform(lambda x : x.fillna(x.mode()[0]))

In [44]:
df['RATING']=df['RATING'].str.extract('(\d+)').astype(float)

In [45]:
df['VOTES'].isna().sum()

1579

In [46]:
df.VOTES.fillna('0',inplace=True)
df['VOTES']=df['VOTES'].str.extract('(\d+)').astype(float)

In [47]:
df.drop(columns='CITY',inplace=True)
df.drop(columns='LOCALITY',inplace=True)
df.drop(columns='CUISINES',inplace=True)

In [48]:
df_City=pd.get_dummies(df['Location'])
df.drop(columns='Location',inplace=True)
df_City.head()

,10th avenue Saane Apartment,1st Stage Maruthi Nagar Main Road,1st Tavarekere 3rd Cross Cashire Layout,3rd Street Old Door AA24 AA Block,5th Main Teachers Colony Koramangala Block 1 Bangalore 560034 The Mylapore Cafe 29,6 & 7 - 4/64 Subhash Nagar 5,682024 Kochi,682035. Kerala,682036 Kerala,APR Chambers House 3-5-909/B/1,...,kochi Kacheripady,kochi Kathrikadavu,kochi Thaikkavu Aluva 6,kochi kakkanad,navi mumbai seawoods grand central mall,opp gurudwara Shakurpur Near Jeevan Jyoti Apartment,opp mukteshwar ashram powai Shop no 3,opposite to western side of ITPL Service gate Whitefield,p.o Kochi Edappally,ward X11 MPL 6303
0,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [49]:
df = pd.concat([df,df_City,df_cuisines,df_title], axis=1)

In [50]:
df.drop(columns='TITLE',inplace=True)

In [51]:
df_column_category = df.select_dtypes(exclude=np.number).columns
df_column_category

Index(['TIME', 'source'], dtype='object')

In [52]:
#df.drop(columns='City found',inplace=True)
df.drop(columns='TIME',inplace=True)

In [53]:
df.fillna(0,inplace=True)

In [54]:
train_final = df[df.source=="train"]
test_final = df[df.source=="test"]

In [55]:
train_final.shape

(12552, 2209)

In [56]:
train_final.drop(columns=["source"],inplace=True)

In [57]:
test_final.drop(columns=["source",'COST'],inplace=True)

In [58]:
train_X = train_final.drop(columns=["COST",'RESTAURANT_ID'])

In [59]:
train_Y = train_final["COST"]

In [60]:
test_X = test_final.drop(columns=["RESTAURANT_ID"])

In [61]:
train_X.fillna(0,inplace=True)
train_X.isna().sum()

RATING                                     0
VOTES                                      0
10th avenue Saane Apartment                0
1st Stage Maruthi Nagar Main Road          0
1st Tavarekere 3rd Cross Cashire Layout    0
                                          ..
DHABA                                      0
MEAT SHOP                                  0
COCKTAIL BAR                               0
PAAN SHOP                                  0
BHOJANALYA                                 0
Length: 2206, dtype: int64

In [62]:
from sklearn.linear_model import LinearRegression
model = LinearRegression()
model.fit(train_X, train_Y)
dtrain_predictions = model.predict(train_X)

In [63]:
from sklearn.model_selection import cross_val_score
a = cross_val_score(model, train_X, train_Y, cv=5, scoring='neg_mean_squared_error')

In [64]:
#Print model report:
from sklearn.metrics import mean_absolute_error,mean_squared_error,mean_squared_log_error, r2_score
print("\nModel Report")
print("RMSE : %.4g" % np.sqrt(mean_squared_error(train_Y.values, dtrain_predictions)))
    
#Predict on testing data:
test_X.fillna(0,inplace=True)
test_final["res_linear"] =  model.predict(test_X)

Model Report
RMSE : 296.9

In [65]:
print('r2 train',r2_score(train_Y,dtrain_predictions))
#print('r2 test',r2_score(test_y,test_predict))

r2 train 0.7771663607832928

In [66]:
Linear_submission = test_final[["RESTAURANT_ID","res_linear"]]

In [67]:
Linear_submission.head(20)

    RESTAURANT_ID   res_linear
0            4085  1033.412544
1           12680   343.699592
2            1411   600.852341
3             204   267.353579
4           13453   225.075083
5            4518   160.219656
6            1643   407.514523
7            5109   988.517067
8            5606   323.034546
9           14319   681.902795
10           4079   208.412286
11           8873   158.102814
12          12322  1961.975635
13           7910  1889.287495
14            309   831.260277
15           1224  1332.651944
16           6376   214.038271
17           3931   194.637863
18           2274   282.178350
19           4974   284.174778